In [51]:
import pandas as pd

In [53]:
df = pd.read_csv("chicago.csv")
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 501.0+ KB

In [58]:
df["Employee Annual Salary"] = df["Employee Annual Salary"].str.replace("$","").astype(float)

In [59]:
df["Employee Annual Salary"].sum()

2571506375.36

In [78]:
df["Position Title"] == "POLICE OFFICER"
df[new]

                        Name Position Title Department  Employee Annual Salary
1          AARON,  JEFFERY M           None     POLICE                 84450.0
2             AARON,  KARINA           None     POLICE                 84450.0
11          ABBATE,  TERRY M           None     POLICE                 90618.0
15           ABDALLAH,  ZAID           None     POLICE                 74028.0
16     ABDELHADI,  ABDALMAHD           None     POLICE                 81588.0
...                      ...            ...        ...                     ...
32054         ZYCH,  MATEUSZ           None     POLICE                 46668.0
32055          ZYDEK,  BRYAN           None     POLICE                 81588.0
32058     ZYGOWICZ,  PETER J           None     POLICE                 87384.0
32059      ZYMANTAS,  MARK E           None     POLICE                 84450.0
32060    ZYRKOWSKI,  CARLO E           None     POLICE                 87384.0

[9184 rows x 4 columns]

In [84]:
df = pd.read_csv("chicago.csv").dropna(how="all")
df.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [87]:
demo = df["Position Title"].str.contains("WATER")
df[demo]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,$82044.00
685,"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MGMNT,$109272.00
702,"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
...,...,...,...,...
29669,"VERMA, ANUPAM",MANAGING ENGINEER - WATER MANAGEMENT,WATER MGMNT,$111192.00
30239,"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MGMNT,$89676.00
30544,"WEST, THOMAS R",GEN SUPT OF WATER MANAGEMENT,WATER MGMNT,$115704.00
30991,"WILLIAMS, MATTHEW",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
31405,"WOODRIDGE, ROBERT L",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00

In [91]:
police = df["Position Title"].str.startswith("POLICE")
df[police]

                        Name  Position Title Department Employee Annual Salary
1          AARON,  JEFFERY M  POLICE OFFICER     POLICE              $84450.00
2             AARON,  KARINA  POLICE OFFICER     POLICE              $84450.00
11          ABBATE,  TERRY M  POLICE OFFICER     POLICE              $90618.00
15           ABDALLAH,  ZAID  POLICE OFFICER     POLICE              $74028.00
16     ABDELHADI,  ABDALMAHD  POLICE OFFICER     POLICE              $81588.00
...                      ...             ...        ...                    ...
32054         ZYCH,  MATEUSZ  POLICE OFFICER     POLICE              $46668.00
32055          ZYDEK,  BRYAN  POLICE OFFICER     POLICE              $81588.00
32058     ZYGOWICZ,  PETER J  POLICE OFFICER     POLICE              $87384.00
32059      ZYMANTAS,  MARK E  POLICE OFFICER     POLICE              $84450.00
32060    ZYRKOWSKI,  CARLO E  POLICE OFFICER     POLICE              $87384.00

[10856 rows x 4 columns]

In [92]:
"                 Welcome to Data Science".lstrip()

'Welcome to Data Science'

In [93]:
"Welcome to Data Science                        ".rstrip()

'Welcome to Data Science'

In [94]:
"    Welcome to Data Science       ".strip()

'Welcome to Data Science'

In [95]:
df["Name"]

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32057    ZYGADLO,  MICHAEL J
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32062, dtype: object

In [99]:
df["Name"] = df["Name"].str.rstrip().str.lstrip()
df["Name"]

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32057    ZYGADLO,  MICHAEL J
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32062, dtype: object

In [101]:
df["Position Title"].str.strip()

0                      WATER RATE TAKER
1                        POLICE OFFICER
2                        POLICE OFFICER
3              CHIEF CONTRACT EXPEDITER
4                     CIVIL ENGINEER IV
                      ...
32057    FRM OF MACHINISTS - AUTOMOTIVE
32058                    POLICE OFFICER
32059                    POLICE OFFICER
32060                    POLICE OFFICER
32061           CHIEF DATA BASE ANALYST
Name: Position Title, Length: 32062, dtype: object

In [103]:
df.values

array([['AARON,  ELVIA J', 'WATER RATE TAKER', 'WATER MGMNT',
        '$90744.00'],
       ['AARON,  JEFFERY M', 'POLICE OFFICER', 'POLICE', '$84450.00'],
       ['AARON,  KARINA', 'POLICE OFFICER', 'POLICE', '$84450.00'],
       ...,
       ['ZYMANTAS,  MARK E', 'POLICE OFFICER', 'POLICE', '$84450.00'],
       ['ZYRKOWSKI,  CARLO E', 'POLICE OFFICER', 'POLICE', '$87384.00'],
       ['ZYSKOWSKI,  DARIUSZ', 'CHIEF DATA BASE ANALYST', 'DoIT',
        '$113664.00']], dtype=object)

In [106]:
df = pd.read_csv("chicago.csv", index_col="Name").dropna(how="all")
df.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [107]:
df.index

Index(['AARON,  ELVIA J', 'AARON,  JEFFERY M', 'AARON,  KARINA',
       'AARON,  KIMBERLEI R', 'ABAD JR,  VICENTE M', 'ABARCA,  ANABEL',
       'ABARCA,  EMMANUEL', 'ABASCAL,  REECE E', 'ABBASI,  CHRISTOPHER',
       'ABBATACOLA,  ROBERT J',
       ...
       'ZWIT,  JEFFREY J', 'ZWOLFER,  MATTHEW W', 'ZYCH,  MATEUSZ',
       'ZYDEK,  BRYAN', 'ZYGADLO,  JOHN P', 'ZYGADLO,  MICHAEL J',
       'ZYGOWICZ,  PETER J', 'ZYMANTAS,  MARK E', 'ZYRKOWSKI,  CARLO E',
       'ZYSKOWSKI,  DARIUSZ'],
      dtype='object', name='Name', length=32062)

In [111]:
df.index = df.index.str.strip().str.title()

In [114]:
df.index
df.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [116]:
df.columns

Index(['Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [117]:
df.columns.str.upper()

Index(['POSITION TITLE', 'DEPARTMENT', 'EMPLOYEE ANNUAL SALARY'], dtype='object')

In [118]:
df.columns = df.columns.str.upper()

In [122]:
df.head()

,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [132]:
df["POSITION TITLE"].str.split(",").str.get(0)

Name
Aaron,  Elvia J                      WATER RATE TAKER
Aaron,  Jeffery M                      POLICE OFFICER
Aaron,  Karina                         POLICE OFFICER
Aaron,  Kimberlei R          CHIEF CONTRACT EXPEDITER
Abad Jr,  Vicente M                 CIVIL ENGINEER IV
                                    ...
Zygadlo,  Michael J    FRM OF MACHINISTS - AUTOMOTIVE
Zygowicz,  Peter J                     POLICE OFFICER
Zymantas,  Mark E                      POLICE OFFICER
Zyrkowski,  Carlo E                    POLICE OFFICER
Zyskowski,  Dariusz           CHIEF DATA BASE ANALYST
Name: POSITION TITLE, Length: 32062, dtype: object

In [140]:
df = pd.read_csv("chicago.csv").dropna(how="all")
df["Department"] = df["Department"].astype("category")
df.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [148]:
df["Name"].str.split(",").str.get(0)

0            AARON
1            AARON
2            AARON
3            AARON
4          ABAD JR
           ...
32057      ZYGADLO
32058     ZYGOWICZ
32059     ZYMANTAS
32060    ZYRKOWSKI
32061    ZYSKOWSKI
Name: Name, Length: 32062, dtype: object

In [146]:
df["Name"].str.split(",").str.get(0).value_counts().head(3)

WILLIAMS    293
JOHNSON     244
SMITH       241
Name: Name, dtype: int64

In [151]:
df[["First Name","Last Name"]]=df["Name"].str.split(",",expand=True)
df.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M

In [160]:
df["Position Title"].str.split(" ", expand=True, n=4)

            0         1           2        3           4
0       WATER      RATE       TAKER     None        None
1      POLICE   OFFICER        None     None        None
2      POLICE   OFFICER        None     None        None
3       CHIEF  CONTRACT   EXPEDITER     None        None
4       CIVIL  ENGINEER          IV     None        None
...       ...       ...         ...      ...         ...
32057     FRM        OF  MACHINISTS        -  AUTOMOTIVE
32058  POLICE   OFFICER        None     None        None
32059  POLICE   OFFICER        None     None        None
32060  POLICE   OFFICER        None     None        None
32061   CHIEF      DATA        BASE  ANALYST        None

[32062 rows x 5 columns]